'use strict'
export default {
    common: {
        200: '请求成功',
        50000: '服务器错误',
        50001: '参数错误'
    },
    getLoginData: {
        50002: '获取运维地址失败',
        50003: '分机号或密码错误',
        50004: '未找到该企业',
        50005: '登录信息获取失败',
        50006: '回拨话机号码校验失败',
        50007: '未知请求',
        50008: '获取技能组失败',
        50009: '获取技能组中坐席失败',
        50010: '获取坐席状态失败'
    },
    login: {
        51000: 'sip注册失败',
        51001: 'socket注册失败'
    },
    functionCode: {
        52000: '预设登录状态失败',
        52001: '预设登录技能组失败',
        52002: '设置坐席模式失败',
        52003: '修改坐席状态失败',
        52004: '设置呼叫保持失败',
        52005: '设置呼叫恢复失败',
        52006: '预设话后状态',
        52007: '取消预设话后状态',
        52008: '来电接听',
        52009: '挂断电话',
        52010: '外呼内线',
        52011: '外呼外线',
        52012: '转接发送失败'
    },
    logOut: { 53000: '签出失败' }
}
